import kleur from 'kleur';

export const DEFAULT_TEXT = "\n" +
    "░█████╗░░█████╗░████████╗██╗██╗░░░██╗░█████╗░████████╗███████╗\n" +
    "██╔══██╗██╔══██╗╚══██╔══╝██║██║░░░██║██╔══██╗╚══██╔══╝██╔════╝\n" +
    "███████║██║░░╚═╝░░░██║░░░██║╚██╗░██╔╝███████║░░░██║░░░█████╗░░\n" +
    "██╔══██║██║░░██╗░░░██║░░░██║░╚████╔╝░██╔══██║░░░██║░░░██╔══╝░░\n" +
    "██║░░██║╚█████╔╝░░░██║░░░██║░░╚██╔╝░░██║░░██║░░░██║░░░███████╗\n" +
    "╚═╝░░╚═╝░╚════╝░░░░╚═╝░░░╚═╝░░░╚═╝░░░╚═╝░░╚═╝░░░╚═╝░░░╚══════╝\n" +
    "🌐 https://github.com/blckclov3r \n" +
    "✉️ blckclov3r@gmail.com \n";

export const SMALL_SQUARE = 1;
export const MOUSE_MOVEMENT_SPEED = 10;
export const MOUSE_CHECK_INTERVAL = 60000;

export const CONSOLE_COLOR = [
    kleur.grey,
    kleur.green,
    kleur.yellow,
    kleur.blue,
    kleur.cyan,
    kleur.magenta,
];

export const PING_URL = ['microsoft.com', 'google.com', 'bing.com', 'stackoverflow.com', 'yahoo.com', 'wikipedia.org', 'mozilla.org', 'outlook.com', 'office.com', 'azure.com'];